package Day07.Review;

import java.util.Scanner;

/***
 * 김조은 팀장에게 예산을 주고
 * 에어컨을 구매하라고 지시하였다.
 * 이때 에어컨 구매비는 다음과 같이 현금으로 지급한다.
 * 구매비		:657825
 * 50000	: 13개
 * 10000	: 0개
 * 5000		: 1개
 * 1000		: 2개
 * 500		: 1개
 * 100		: 3개
 * 50		: 0개
 * 10		: 2개
 * 5		: 1개
 * 1		: 0개
 * 위와 같이 입력하면,
 * 큰 화폐단위부터 계산하여, 화폐단위별로 화페매수를 출력하는 프로그램을 작성하시오.
 */
public class Ex03_화폐매수 {
	
	public static void main(String[] args) {
		/*
		 * 1. 필요한 변수 선언
		 * 		-(입력금액), (화폐매수), (화폐단위)
		 * 2. 구매비 입력
		 * 3. 화폐매수 계산
		 * 		3-1. 화폐매수 계산
		 * 			(화폐매수) = (입력금액) / (화폐단위)
		 * 		3-2. 잔액 계산
		 * 			657825 - (50000 * 13)
	 * 				(잔액) = (입력금액) - (화폐단위 * 화폐매수) or
	 * 				(잔액) = (입력금액) % (화폐단위)
		 * 		3-3. 화폐 단위 변환
		 * 			번갈아 가면서, /5, /2 연산을 반복
		 * 			(화폐단위) = (화폐단위) / 5
		 * 			(화폐단위) = (화폐단위) / 2
		 * 4. 3번 과정을 반복
		  
		 */
		//boolean sw = true;
		Scanner sc = new Scanner(System.in);
		System.out.println("구매비 : ");
		int input = sc.nextInt();
		int money[] = {50000,10000,5000,1000,500,100,50,10,5,1};
		int i = 0;
		
//		while(money[0] >= 1) {
		while(i <= 9) {
			// 화폐매수 계산
			int count = input / money[i];
			System.out.println(money[i] + " : " + count + "개");
			
			// 잔액 계산
			input = input % money[i];		//input = input - (50000 * count);
			
			//화폐단위 순서를 증가
			i++;
			
			// 화폐단위 변환
//			if(sw) {
//			money = money / 5;
//			}
//			else {
//			money = money / 2;
//			}
//			sw = !sw;

		}
	
		
//		int M50000 = M / 50000;
//		int M10000 = (M % 50000)/ 10000;
//		int M5000 = ((M % 50000)% 10000) / 5000;
//		int M1000 = (((M % 50000)% 10000) % 5000) / 1000;
//		int M500 = ((((M % 50000)% 10000) % 5000) % 1000)/ 500;
//		int M100 = (((((M % 50000)% 10000) % 5000) % 1000)% 500)/ 100;
//		int M50 = ((((((M % 50000)% 10000) % 5000) % 1000)% 500)% 100) / 50;
//		int M10 = (((((((M % 50000)% 10000) % 5000) % 1000)% 500)% 100) % 50)/ 10;
//		int M5 = ((((((((M % 50000)% 10000) % 5000) % 1000)% 500)% 100) % 50)% 10) / 5;
//		int M1 = (((((((((M % 50000)% 10000) % 5000) % 1000)% 500)% 100) % 50)% 10) % 5)/1;
//		
//
//		System.out.println("50000원 : " + M50000 + "개");
//		System.out.println("10000원 : " + M10000 + "개");
//		System.out.println("5000원 : " + M5000 + "개");
//		System.out.println("1000원 : " + M1000 + "개");
//		System.out.println("500원 : " + M500 + "개");
//		System.out.println("100원 : " + M100 + "개");
//		System.out.println("50원 : " + M50 + "개");
//		System.out.println("10원 : " + M10 + "개");
//		System.out.println("5원 : " + M5 + "개");
//		System.out.println("1원 : " + M1 + "개");
	

	}
}
